alexanderboric/rockbox/firmware/target/arm/stm32u5/regs/stm32u5a5/rcc.h
/***************************************************************************
 *             __________               __   ___.
 *   Open      \______   \ ____   ____ |  | _\_ |__   _______  ___
 *   Source     |       _//  _ \_/ ___\|  |/ /| __ \ /  _ \  \/  /
 *   Jukebox    |    |   (  <_> )  \___|    < | \_\ (  <_> > <  <
 *   Firmware   |____|_  /\____/ \___  >__|_ \|___  /\____/__/\_ \
 *                     \/            \/     \/    \/            \/
 * $Id$
 *
 * Copyright (C) 2026 by Aidan MacDonald
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This software is distributed on an "AS IS" basis, WITHOUT WARRANTY OF ANY
 * KIND, either express or implied.
 *
 ****************************************************************************/
#ifndef __REGS_STM32U5A5_RCC_H__
#define __REGS_STM32U5A5_RCC_H__

#include "reggen.h"

/*
 * STM32U5A5 Reset and Clock Control (RCC)
 * Base address: 0x46020C00  (RM0456 Rev 10)
 */

#define RCC_BASE  0x46020C00u

/* RCC_CR - Clock control register */
#define ITA_RCC_CR          ((uint32_t *)(RCC_BASE + 0x000))
#define ITTA_RCC_CR         uint32_t
#define ITNA_RCC_CR         RCC_CR

#define BP_RCC_CR_MSISON        0
#define BM_RCC_CR_MSISON        (1u << 0)
#define BF_RCC_CR_MSISON(v)     (((v) & 1u) << 0)
#define BFM_RCC_CR_MSISON(v)    (1u << 0)

#define BP_RCC_CR_MSIRKERDY     1
#define BM_RCC_CR_MSIRKERDY     (1u << 1)
#define BF_RCC_CR_MSIRKERDY(v)  (((v) & 1u) << 1)
#define BFM_RCC_CR_MSIRKERDY(v) (1u << 1)

#define BP_RCC_CR_MSIPLLEN      2
#define BM_RCC_CR_MSIPLLEN      (1u << 2)
#define BF_RCC_CR_MSIPLLEN(v)   (((v) & 1u) << 2)
#define BFM_RCC_CR_MSIPLLEN(v)  (1u << 2)

#define BP_RCC_CR_MSIKON        4
#define BM_RCC_CR_MSIKON        (1u << 4)
#define BF_RCC_CR_MSIKON(v)     (((v) & 1u) << 4)
#define BFM_RCC_CR_MSIKON(v)    (1u << 4)

#define BP_RCC_CR_MSIRDY        5
#define BM_RCC_CR_MSIRDY        (1u << 5)
#define BF_RCC_CR_MSIRDY(v)     (((v) & 1u) << 5)
#define BFM_RCC_CR_MSIRDY(v)    (1u << 5)

#define BP_RCC_CR_MSIKERON      6
#define BM_RCC_CR_MSIKERON      (1u << 6)
#define BF_RCC_CR_MSIKERON(v)   (((v) & 1u) << 6)
#define BFM_RCC_CR_MSIKERON(v)  (1u << 6)

#define BP_RCC_CR_HSION         8
#define BM_RCC_CR_HSION         (1u << 8)
#define BF_RCC_CR_HSION(v)      (((v) & 1u) << 8)
#define BFM_RCC_CR_HSION(v)     (1u << 8)

#define BP_RCC_CR_HSIRDY        10
#define BM_RCC_CR_HSIRDY        (1u << 10)
#define BF_RCC_CR_HSIRDY(v)     (((v) & 1u) << 10)
#define BFM_RCC_CR_HSIRDY(v)    (1u << 10)

#define BP_RCC_CR_HSEON         16
#define BM_RCC_CR_HSEON         (1u << 16)
#define BF_RCC_CR_HSEON(v)      (((v) & 1u) << 16)
#define BFM_RCC_CR_HSEON(v)     (1u << 16)

#define BP_RCC_CR_HSERDY        17
#define BM_RCC_CR_HSERDY        (1u << 17)
#define BF_RCC_CR_HSERDY(v)     (((v) & 1u) << 17)
#define BFM_RCC_CR_HSERDY(v)    (1u << 17)

#define BP_RCC_CR_HSEBYP        18
#define BM_RCC_CR_HSEBYP        (1u << 18)
#define BF_RCC_CR_HSEBYP(v)     (((v) & 1u) << 18)
#define BFM_RCC_CR_HSEBYP(v)    (1u << 18)

#define BP_RCC_CR_CSSON         19
#define BM_RCC_CR_CSSON         (1u << 19)
#define BF_RCC_CR_CSSON(v)      (((v) & 1u) << 19)
#define BFM_RCC_CR_CSSON(v)     (1u << 19)

#define BP_RCC_CR_PLL1ON        24
#define BM_RCC_CR_PLL1ON        (1u << 24)
#define BF_RCC_CR_PLL1ON(v)     (((v) & 1u) << 24)
#define BFM_RCC_CR_PLL1ON(v)    (1u << 24)

#define BP_RCC_CR_PLL1RDY       25
#define BM_RCC_CR_PLL1RDY       (1u << 25)
#define BF_RCC_CR_PLL1RDY(v)    (((v) & 1u) << 25)
#define BFM_RCC_CR_PLL1RDY(v)   (1u << 25)

#define BP_RCC_CR_PLL2ON        26
#define BM_RCC_CR_PLL2ON        (1u << 26)
#define BF_RCC_CR_PLL2ON(v)     (((v) & 1u) << 26)
#define BFM_RCC_CR_PLL2ON(v)    (1u << 26)

#define BP_RCC_CR_PLL2RDY       27
#define BM_RCC_CR_PLL2RDY       (1u << 27)
#define BF_RCC_CR_PLL2RDY(v)    (((v) & 1u) << 27)
#define BFM_RCC_CR_PLL2RDY(v)   (1u << 27)

#define BP_RCC_CR_PLL3ON        28
#define BM_RCC_CR_PLL3ON        (1u << 28)
#define BF_RCC_CR_PLL3ON(v)     (((v) & 1u) << 28)
#define BFM_RCC_CR_PLL3ON(v)    (1u << 28)

#define BP_RCC_CR_PLL3RDY       29
#define BM_RCC_CR_PLL3RDY       (1u << 29)
#define BF_RCC_CR_PLL3RDY(v)    (((v) & 1u) << 29)
#define BFM_RCC_CR_PLL3RDY(v)   (1u << 29)

/* RCC_CFGR1 - Clock configuration register 1 */
#define ITA_RCC_CFGR1       ((uint32_t *)(RCC_BASE + 0x01C))
#define ITTA_RCC_CFGR1      uint32_t
#define ITNA_RCC_CFGR1      RCC_CFGR1

/* SW: system clock switch - 3 bits */
#define BP_RCC_CFGR1_SW         0
#define BM_RCC_CFGR1_SW         (7u << 0)
#define BF_RCC_CFGR1_SW(v)      (((v) & 7u) << 0)
#define BFM_RCC_CFGR1_SW(v)     (7u << 0)
#define BV_RCC_CFGR1_SW_MSIS    0
#define BV_RCC_CFGR1_SW_HSI16   1
#define BV_RCC_CFGR1_SW_HSE     2
#define BV_RCC_CFGR1_SW_PLL1    3
#define BF_RCC_CFGR1_SW_V(n)    BF_RCC_CFGR1_SW(BV_RCC_CFGR1_SW_##n)
/* Shorthand for convenience */
#define SW_V(n)                 BF_RCC_CFGR1_SW_V(n)

/* SWS: system clock switch status - 3 bits */
#define BP_RCC_CFGR1_SWS        4
#define BM_RCC_CFGR1_SWS        (7u << 4)
#define BF_RCC_CFGR1_SWS(v)     (((v) & 7u) << 4)
#define BFM_RCC_CFGR1_SWS(v)    (7u << 4)
#define BV_RCC_CFGR1_SWS_PLL1   3

/* MCO selection */
#define BP_RCC_CFGR1_MCOSEL     24
#define BM_RCC_CFGR1_MCOSEL     (0xFu << 24)
#define BF_RCC_CFGR1_MCOSEL(v)  (((v) & 0xFu) << 24)
#define BFM_RCC_CFGR1_MCOSEL(v) (0xFu << 24)

#define BP_RCC_CFGR1_MCOPRE     28
#define BM_RCC_CFGR1_MCOPRE     (7u << 28)
#define BF_RCC_CFGR1_MCOPRE(v)  (((v) & 7u) << 28)
#define BFM_RCC_CFGR1_MCOPRE(v) (7u << 28)

/* RCC_CFGR2 - Clock configuration register 2 (AHB/APB prescalers) */
#define ITA_RCC_CFGR2       ((uint32_t *)(RCC_BASE + 0x020))
#define ITTA_RCC_CFGR2      uint32_t
#define ITNA_RCC_CFGR2      RCC_CFGR2

/* HPRE: AHB prescaler */
#define BP_RCC_CFGR2_HPRE       0
#define BM_RCC_CFGR2_HPRE       (0xFu << 0)
#define BF_RCC_CFGR2_HPRE(v)    (((v) & 0xFu) << 0)
#define BFM_RCC_CFGR2_HPRE(v)   (0xFu << 0)
/* 0xxx=no divide, 1000=/2, 1001=/4, 1010=/8, 1011=/16, 1100=/64, 1101=/128, 1110=/256, 1111=/512 */

/* PPRE1: APB1 prescaler */
#define BP_RCC_CFGR2_PPRE1      4
#define BM_RCC_CFGR2_PPRE1      (7u << 4)
#define BF_RCC_CFGR2_PPRE1(v)   (((v) & 7u) << 4)
#define BFM_RCC_CFGR2_PPRE1(v)  (7u << 4)
/* 0xx=no divide, 100=/2, 101=/4, 110=/8, 111=/16 */

/* PPRE2: APB2 prescaler */
#define BP_RCC_CFGR2_PPRE2      8
#define BM_RCC_CFGR2_PPRE2      (7u << 8)
#define BF_RCC_CFGR2_PPRE2(v)   (((v) & 7u) << 8)
#define BFM_RCC_CFGR2_PPRE2(v)  (7u << 8)

/* RCC_CFGR3 - Clock configuration register 3 (APB3 prescaler) */
#define ITA_RCC_CFGR3       ((uint32_t *)(RCC_BASE + 0x024))
#define ITTA_RCC_CFGR3      uint32_t
#define ITNA_RCC_CFGR3      RCC_CFGR3

/* PPRE3: APB3 prescaler */
#define BP_RCC_CFGR3_PPRE3      4
#define BM_RCC_CFGR3_PPRE3      (7u << 4)
#define BF_RCC_CFGR3_PPRE3(v)   (((v) & 7u) << 4)
#define BFM_RCC_CFGR3_PPRE3(v)  (7u << 4)

/* RCC_PLL1CFGR - PLL1 configuration register */
#define ITA_RCC_PLL1CFGR    ((uint32_t *)(RCC_BASE + 0x028))
#define ITTA_RCC_PLL1CFGR   uint32_t
#define ITNA_RCC_PLL1CFGR   RCC_PLL1CFGR

/* PLL1SRC: PLL1 input clock source */
#define BP_RCC_PLL1CFGR_PLL1SRC     0
#define BM_RCC_PLL1CFGR_PLL1SRC     (3u << 0)
#define BF_RCC_PLL1CFGR_PLL1SRC(v)  (((v) & 3u) << 0)
#define BFM_RCC_PLL1CFGR_PLL1SRC(v) (3u << 0)
#define BV_RCC_PLL1CFGR_PLL1SRC_NONE   0
#define BV_RCC_PLL1CFGR_PLL1SRC_MSIS   1
#define BV_RCC_PLL1CFGR_PLL1SRC_HSI16  2
#define BV_RCC_PLL1CFGR_PLL1SRC_HSE    3
#define BF_RCC_PLL1CFGR_PLL1SRC_V(n)   BF_RCC_PLL1CFGR_PLL1SRC(BV_RCC_PLL1CFGR_PLL1SRC_##n)
/* Shorthand for convenience */
#define PLL1SRC_V(n)                   BF_RCC_PLL1CFGR_PLL1SRC_V(n)

