alexanderboric/rockbox/firmware/target/arm/stm32u5/regs/stm32u5a5/rcc.h
/* PLL1RGE: PLL1 input frequency range */
#define BP_RCC_PLL1CFGR_PLL1RGE     2
#define BM_RCC_PLL1CFGR_PLL1RGE     (3u << 2)
#define BF_RCC_PLL1CFGR_PLL1RGE(v)  (((v) & 3u) << 2)
#define BFM_RCC_PLL1CFGR_PLL1RGE(v) (3u << 2)
/* 00: 4-8 MHz, 01: 4-8 MHz, 10: 8-16 MHz, 11: 8-16 MHz */

/* PLL1FRACEN: PLL1 fractional latch enable */
#define BP_RCC_PLL1CFGR_PLL1FRACEN     4
#define BM_RCC_PLL1CFGR_PLL1FRACEN     (1u << 4)
#define BF_RCC_PLL1CFGR_PLL1FRACEN(v)  (((v) & 1u) << 4)
#define BFM_RCC_PLL1CFGR_PLL1FRACEN(v) (1u << 4)

/* PLL1VCOSEL: PLL1 VCO selection */
#define BP_RCC_PLL1CFGR_PLL1VCOSEL     5
#define BM_RCC_PLL1CFGR_PLL1VCOSEL     (1u << 5)
#define BF_RCC_PLL1CFGR_PLL1VCOSEL(v)  (((v) & 1u) << 5)
#define BFM_RCC_PLL1CFGR_PLL1VCOSEL(v) (1u << 5)
/* 0: wide VCO (128-544 MHz), 1: medium VCO (150-420 MHz) */

/* DIVM1: PLL1 prescaler (6 bits) */
#define BP_RCC_PLL1CFGR_DIVM1      8
#define BM_RCC_PLL1CFGR_DIVM1      (0x3Fu << 8)
#define BF_RCC_PLL1CFGR_DIVM1(v)   (((v) & 0x3Fu) << 8)
#define BFM_RCC_PLL1CFGR_DIVM1(v)  (0x3Fu << 8)

/* PLL1PEN/QEN/REN: enable PLL1P/Q/R outputs */
#define BP_RCC_PLL1CFGR_PLL1PEN     16
#define BM_RCC_PLL1CFGR_PLL1PEN     (1u << 16)
#define BF_RCC_PLL1CFGR_PLL1PEN(v)  (((v) & 1u) << 16)
#define BFM_RCC_PLL1CFGR_PLL1PEN(v) (1u << 16)

#define BP_RCC_PLL1CFGR_PLL1QEN     17
#define BM_RCC_PLL1CFGR_PLL1QEN     (1u << 17)
#define BF_RCC_PLL1CFGR_PLL1QEN(v)  (((v) & 1u) << 17)
#define BFM_RCC_PLL1CFGR_PLL1QEN(v) (1u << 17)

#define BP_RCC_PLL1CFGR_PLL1REN     18
#define BM_RCC_PLL1CFGR_PLL1REN     (1u << 18)
#define BF_RCC_PLL1CFGR_PLL1REN(v)  (((v) & 1u) << 18)
#define BFM_RCC_PLL1CFGR_PLL1REN(v) (1u << 18)

/* RCC_PLL1DIVR - PLL1 dividers register */
#define ITA_RCC_PLL1DIVR    ((uint32_t *)(RCC_BASE + 0x034))
#define ITTA_RCC_PLL1DIVR   uint32_t
#define ITNA_RCC_PLL1DIVR   RCC_PLL1DIVR

#define BP_RCC_PLL1DIVR_DIVN    0
#define BM_RCC_PLL1DIVR_DIVN    (0x1FFu << 0)
#define BF_RCC_PLL1DIVR_DIVN(v) (((v) & 0x1FFu) << 0)
#define BFM_RCC_PLL1DIVR_DIVN(v) (0x1FFu << 0)

#define BP_RCC_PLL1DIVR_DIVP    9
#define BM_RCC_PLL1DIVR_DIVP    (0x7Fu << 9)
#define BF_RCC_PLL1DIVR_DIVP(v) (((v) & 0x7Fu) << 9)
#define BFM_RCC_PLL1DIVR_DIVP(v) (0x7Fu << 9)

#define BP_RCC_PLL1DIVR_DIVQ    16
#define BM_RCC_PLL1DIVR_DIVQ    (0x7Fu << 16)
#define BF_RCC_PLL1DIVR_DIVQ(v) (((v) & 0x7Fu) << 16)
#define BFM_RCC_PLL1DIVR_DIVQ(v) (0x7Fu << 16)

#define BP_RCC_PLL1DIVR_DIVR    24
#define BM_RCC_PLL1DIVR_DIVR    (0x7Fu << 24)
#define BF_RCC_PLL1DIVR_DIVR(v) (((v) & 0x7Fu) << 24)
#define BFM_RCC_PLL1DIVR_DIVR(v) (0x7Fu << 24)

/* RCC_BDCR - Backup domain control register */
#define ITA_RCC_BDCR        ((uint32_t *)(RCC_BASE + 0x0B0))
#define ITTA_RCC_BDCR       uint32_t
#define ITNA_RCC_BDCR       RCC_BDCR

#define BP_RCC_BDCR_LSEON       0
#define BM_RCC_BDCR_LSEON       (1u << 0)
#define BF_RCC_BDCR_LSEON(v)    (((v) & 1u) << 0)
#define BFM_RCC_BDCR_LSEON(v)   (1u << 0)

#define BP_RCC_BDCR_LSERDY      1
#define BM_RCC_BDCR_LSERDY      (1u << 1)
#define BF_RCC_BDCR_LSERDY(v)   (((v) & 1u) << 1)
#define BFM_RCC_BDCR_LSERDY(v)  (1u << 1)

#define BP_RCC_BDCR_LSEBYP      2
#define BM_RCC_BDCR_LSEBYP      (1u << 2)
#define BF_RCC_BDCR_LSEBYP(v)   (((v) & 1u) << 2)
#define BFM_RCC_BDCR_LSEBYP(v)  (1u << 2)

#define BP_RCC_BDCR_LSEDRV      3
#define BM_RCC_BDCR_LSEDRV      (3u << 3)
#define BF_RCC_BDCR_LSEDRV(v)   (((v) & 3u) << 3)
#define BFM_RCC_BDCR_LSEDRV(v)  (3u << 3)

#define BP_RCC_BDCR_RTCSEL      8
#define BM_RCC_BDCR_RTCSEL      (3u << 8)
#define BF_RCC_BDCR_RTCSEL(v)   (((v) & 3u) << 8)
#define BFM_RCC_BDCR_RTCSEL(v)  (3u << 8)
#define BV_RCC_BDCR_RTCSEL_LSE  1
#define BV_RCC_BDCR_RTCSEL_LSI  2
#define BV_RCC_BDCR_RTCSEL_HSE  3
#define BF_RCC_BDCR_RTCSEL_V(n) BF_RCC_BDCR_RTCSEL(BV_RCC_BDCR_RTCSEL_##n)

#define BP_RCC_BDCR_RTCEN       15
#define BM_RCC_BDCR_RTCEN       (1u << 15)
#define BF_RCC_BDCR_RTCEN(v)    (((v) & 1u) << 15)
#define BFM_RCC_BDCR_RTCEN(v)   (1u << 15)

#define BP_RCC_BDCR_BDRST       16
#define BM_RCC_BDCR_BDRST       (1u << 16)
#define BF_RCC_BDCR_BDRST(v)    (((v) & 1u) << 16)
#define BFM_RCC_BDCR_BDRST(v)   (1u << 16)

/* RCC_CSR - Control/status register */
#define ITA_RCC_CSR         ((uint32_t *)(RCC_BASE + 0x0B4))
#define ITTA_RCC_CSR        uint32_t
#define ITNA_RCC_CSR        RCC_CSR

#define BP_RCC_CSR_LSION        0
#define BM_RCC_CSR_LSION        (1u << 0)
#define BF_RCC_CSR_LSION(v)     (((v) & 1u) << 0)
#define BFM_RCC_CSR_LSION(v)    (1u << 0)

#define BP_RCC_CSR_LSIRDY       1
#define BM_RCC_CSR_LSIRDY       (1u << 1)
#define BF_RCC_CSR_LSIRDY(v)    (((v) & 1u) << 1)
#define BFM_RCC_CSR_LSIRDY(v)   (1u << 1)

/* RCC_AHB1ENR - AHB1 peripheral clock enable */
#define ITA_RCC_AHB1ENR     ((uint32_t *)(RCC_BASE + 0x088))
#define ITTA_RCC_AHB1ENR    uint32_t
#define ITNA_RCC_AHB1ENR    RCC_AHB1ENR

#define BP_RCC_AHB1ENR_GPDMA1EN     0
#define BM_RCC_AHB1ENR_GPDMA1EN     (1u << 0)
#define BF_RCC_AHB1ENR_GPDMA1EN(v)  (((v) & 1u) << 0)
#define BFM_RCC_AHB1ENR_GPDMA1EN(v) (1u << 0)

#define BP_RCC_AHB1ENR_GPDMA2EN     1
#define BM_RCC_AHB1ENR_GPDMA2EN     (1u << 1)
#define BF_RCC_AHB1ENR_GPDMA2EN(v)  (((v) & 1u) << 1)
#define BFM_RCC_AHB1ENR_GPDMA2EN(v) (1u << 1)

#define BP_RCC_AHB1ENR_FLASHEN      8
#define BM_RCC_AHB1ENR_FLASHEN      (1u << 8)
#define BF_RCC_AHB1ENR_FLASHEN(v)   (((v) & 1u) << 8)
#define BFM_RCC_AHB1ENR_FLASHEN(v)  (1u << 8)

#define BP_RCC_AHB1ENR_CRCEN        12
#define BM_RCC_AHB1ENR_CRCEN        (1u << 12)
#define BF_RCC_AHB1ENR_CRCEN(v)     (((v) & 1u) << 12)
#define BFM_RCC_AHB1ENR_CRCEN(v)    (1u << 12)

/* RCC_AHB2ENR1 - AHB2 peripheral clock enable 1 (GPIO, USB, SDMMC) */
#define ITA_RCC_AHB2ENR1    ((uint32_t *)(RCC_BASE + 0x08C))
#define ITTA_RCC_AHB2ENR1   uint32_t
#define ITNA_RCC_AHB2ENR1   RCC_AHB2ENR1

#define BP_RCC_AHB2ENR1_GPIOAEN    0
#define BM_RCC_AHB2ENR1_GPIOAEN    (1u << 0)
#define BF_RCC_AHB2ENR1_GPIOAEN(v) (((v) & 1u) << 0)
#define BFM_RCC_AHB2ENR1_GPIOAEN(v) (1u << 0)

#define BP_RCC_AHB2ENR1_GPIOBEN    1
#define BM_RCC_AHB2ENR1_GPIOBEN    (1u << 1)
#define BF_RCC_AHB2ENR1_GPIOBEN(v) (((v) & 1u) << 1)
#define BFM_RCC_AHB2ENR1_GPIOBEN(v) (1u << 1)

