alexanderboric/rockbox/firmware/target/arm/stm32u5/regs/stm32u5a5/rcc.h
#define BP_RCC_AHB2ENR1_GPIOCEN    2
#define BM_RCC_AHB2ENR1_GPIOCEN    (1u << 2)
#define BF_RCC_AHB2ENR1_GPIOCEN(v) (((v) & 1u) << 2)
#define BFM_RCC_AHB2ENR1_GPIOCEN(v) (1u << 2)

#define BP_RCC_AHB2ENR1_GPIODEN    3
#define BM_RCC_AHB2ENR1_GPIODEN    (1u << 3)
#define BF_RCC_AHB2ENR1_GPIODEN(v) (((v) & 1u) << 3)
#define BFM_RCC_AHB2ENR1_GPIODEN(v) (1u << 3)

#define BP_RCC_AHB2ENR1_GPIOEEN    4
#define BM_RCC_AHB2ENR1_GPIOEEN    (1u << 4)
#define BF_RCC_AHB2ENR1_GPIOEEN(v) (((v) & 1u) << 4)
#define BFM_RCC_AHB2ENR1_GPIOEEN(v) (1u << 4)

#define BP_RCC_AHB2ENR1_GPIOFEN    5
#define BM_RCC_AHB2ENR1_GPIOFEN    (1u << 5)
#define BF_RCC_AHB2ENR1_GPIOFEN(v) (((v) & 1u) << 5)
#define BFM_RCC_AHB2ENR1_GPIOFEN(v) (1u << 5)

#define BP_RCC_AHB2ENR1_GPIOGEN    6
#define BM_RCC_AHB2ENR1_GPIOGEN    (1u << 6)
#define BF_RCC_AHB2ENR1_GPIOGEN(v) (((v) & 1u) << 6)
#define BFM_RCC_AHB2ENR1_GPIOGEN(v) (1u << 6)

#define BP_RCC_AHB2ENR1_GPIOHEN    7
#define BM_RCC_AHB2ENR1_GPIOHEN    (1u << 7)
#define BF_RCC_AHB2ENR1_GPIOHEN(v) (((v) & 1u) << 7)
#define BFM_RCC_AHB2ENR1_GPIOHEN(v) (1u << 7)

#define BP_RCC_AHB2ENR1_GPIOIEN    8
#define BM_RCC_AHB2ENR1_GPIOIEN    (1u << 8)
#define BF_RCC_AHB2ENR1_GPIOIEN(v) (((v) & 1u) << 8)
#define BFM_RCC_AHB2ENR1_GPIOIEN(v) (1u << 8)

#define BP_RCC_AHB2ENR1_ADC12EN    10
#define BM_RCC_AHB2ENR1_ADC12EN    (1u << 10)
#define BF_RCC_AHB2ENR1_ADC12EN(v) (((v) & 1u) << 10)
#define BFM_RCC_AHB2ENR1_ADC12EN(v) (1u << 10)

/* USB_FS (USB DRD Full-Speed) */
#define BP_RCC_AHB2ENR1_USB_FSEN    14
#define BM_RCC_AHB2ENR1_USB_FSEN    (1u << 14)
#define BF_RCC_AHB2ENR1_USB_FSEN(v) (((v) & 1u) << 14)
#define BFM_RCC_AHB2ENR1_USB_FSEN(v) (1u << 14)

#define BP_RCC_AHB2ENR1_SDMMC1EN    27
#define BM_RCC_AHB2ENR1_SDMMC1EN    (1u << 27)
#define BF_RCC_AHB2ENR1_SDMMC1EN(v) (((v) & 1u) << 27)
#define BFM_RCC_AHB2ENR1_SDMMC1EN(v) (1u << 27)

#define BP_RCC_AHB2ENR1_SDMMC2EN    28
#define BM_RCC_AHB2ENR1_SDMMC2EN    (1u << 28)
#define BF_RCC_AHB2ENR1_SDMMC2EN(v) (((v) & 1u) << 28)
#define BFM_RCC_AHB2ENR1_SDMMC2EN(v) (1u << 28)

/* RCC_APB1ENR1 - APB1 peripheral clock enable 1 (I2C, etc.) */
#define ITA_RCC_APB1ENR1    ((uint32_t *)(RCC_BASE + 0x09C))
#define ITTA_RCC_APB1ENR1   uint32_t
#define ITNA_RCC_APB1ENR1   RCC_APB1ENR1

#define BP_RCC_APB1ENR1_I2C1EN      21
#define BM_RCC_APB1ENR1_I2C1EN      (1u << 21)
#define BF_RCC_APB1ENR1_I2C1EN(v)   (((v) & 1u) << 21)
#define BFM_RCC_APB1ENR1_I2C1EN(v)  (1u << 21)

#define BP_RCC_APB1ENR1_I2C2EN      22
#define BM_RCC_APB1ENR1_I2C2EN      (1u << 22)
#define BF_RCC_APB1ENR1_I2C2EN(v)   (((v) & 1u) << 22)
#define BFM_RCC_APB1ENR1_I2C2EN(v)  (1u << 22)

#define BP_RCC_APB1ENR1_I2C3EN      23
#define BM_RCC_APB1ENR1_I2C3EN      (1u << 23)
#define BF_RCC_APB1ENR1_I2C3EN(v)   (((v) & 1u) << 23)
#define BFM_RCC_APB1ENR1_I2C3EN(v)  (1u << 23)

/* RCC_APB2ENR - APB2 peripheral clock enable (SAI, SPI1) */
#define ITA_RCC_APB2ENR     ((uint32_t *)(RCC_BASE + 0x0A4))
#define ITTA_RCC_APB2ENR    uint32_t
#define ITNA_RCC_APB2ENR    RCC_APB2ENR

#define BP_RCC_APB2ENR_SPI1EN       12
#define BM_RCC_APB2ENR_SPI1EN       (1u << 12)
#define BF_RCC_APB2ENR_SPI1EN(v)    (((v) & 1u) << 12)
#define BFM_RCC_APB2ENR_SPI1EN(v)   (1u << 12)

#define BP_RCC_APB2ENR_SAI1EN       21
#define BM_RCC_APB2ENR_SAI1EN       (1u << 21)
#define BF_RCC_APB2ENR_SAI1EN(v)    (((v) & 1u) << 21)
#define BFM_RCC_APB2ENR_SAI1EN(v)   (1u << 21)

#define BP_RCC_APB2ENR_SAI2EN       22
#define BM_RCC_APB2ENR_SAI2EN       (1u << 22)
#define BF_RCC_APB2ENR_SAI2EN(v)    (((v) & 1u) << 22)
#define BFM_RCC_APB2ENR_SAI2EN(v)   (1u << 22)

/* RCC_APB3ENR - APB3 peripheral clock enable (SYSCFG, LTDC) */
#define ITA_RCC_APB3ENR     ((uint32_t *)(RCC_BASE + 0x0A8))
#define ITTA_RCC_APB3ENR    uint32_t
#define ITNA_RCC_APB3ENR    RCC_APB3ENR

#define BP_RCC_APB3ENR_SYSCFGEN     1
#define BM_RCC_APB3ENR_SYSCFGEN     (1u << 1)
#define BF_RCC_APB3ENR_SYSCFGEN(v)  (((v) & 1u) << 1)
#define BFM_RCC_APB3ENR_SYSCFGEN(v) (1u << 1)

#define BP_RCC_APB3ENR_LTDCEN       2
#define BM_RCC_APB3ENR_LTDCEN       (1u << 2)
#define BF_RCC_APB3ENR_LTDCEN(v)    (((v) & 1u) << 2)
#define BFM_RCC_APB3ENR_LTDCEN(v)   (1u << 2)

/* RCC_AHB1RSTR - AHB1 reset register */
#define ITA_RCC_AHB1RSTR    ((uint32_t *)(RCC_BASE + 0x060))
#define ITTA_RCC_AHB1RSTR   uint32_t
#define ITNA_RCC_AHB1RSTR   RCC_AHB1RSTR

/* RCC_AHB2RSTR1 - AHB2 reset register 1 */
#define ITA_RCC_AHB2RSTR1   ((uint32_t *)(RCC_BASE + 0x064))
#define ITTA_RCC_AHB2RSTR1  uint32_t
#define ITNA_RCC_AHB2RSTR1  RCC_AHB2RSTR1

#define BP_RCC_AHB2RSTR1_SDMMC1RST     27
#define BM_RCC_AHB2RSTR1_SDMMC1RST     (1u << 27)
#define BF_RCC_AHB2RSTR1_SDMMC1RST(v)  (((v) & 1u) << 27)
#define BFM_RCC_AHB2RSTR1_SDMMC1RST(v) (1u << 27)

/* RCC_CCIPR1 - Peripherals independent clock configuration register 1 */
#define ITA_RCC_CCIPR1      ((uint32_t *)(RCC_BASE + 0x100))
#define ITTA_RCC_CCIPR1     uint32_t
#define ITNA_RCC_CCIPR1     RCC_CCIPR1

/* I2C1 kernel clock selection */
#define BP_RCC_CCIPR1_I2C1SEL       16
#define BM_RCC_CCIPR1_I2C1SEL       (3u << 16)
#define BF_RCC_CCIPR1_I2C1SEL(v)    (((v) & 3u) << 16)
#define BFM_RCC_CCIPR1_I2C1SEL(v)   (3u << 16)
/* 00=PCLK1, 01=SYSCLK, 10=HSI16, 11=MSIK */
#define BV_RCC_CCIPR1_I2C1SEL_HSI16 2
#define BF_RCC_CCIPR1_I2C1SEL_V(n)  BF_RCC_CCIPR1_I2C1SEL(BV_RCC_CCIPR1_I2C1SEL_##n)
/* Shorthand for convenience */
#define I2C1SEL_V(n)                BF_RCC_CCIPR1_I2C1SEL_V(n)

/* RCC_CCIPR2 - Peripherals independent clock configuration register 2 */
#define ITA_RCC_CCIPR2      ((uint32_t *)(RCC_BASE + 0x104))
#define ITTA_RCC_CCIPR2     uint32_t
#define ITNA_RCC_CCIPR2     RCC_CCIPR2

/* SDMMC1 kernel clock selection */
#define BP_RCC_CCIPR2_SDMMC1SEL     0
#define BM_RCC_CCIPR2_SDMMC1SEL     (1u << 0)
#define BF_RCC_CCIPR2_SDMMC1SEL(v)  (((v) & 1u) << 0)
#define BFM_RCC_CCIPR2_SDMMC1SEL(v) (1u << 0)
/* 0=48CLK (from PLL1Q or HSI48), 1=PLL1P */
#define BV_RCC_CCIPR2_SDMMC1SEL_48CLK  0
#define BV_RCC_CCIPR2_SDMMC1SEL_PLL1P  1
#define BF_RCC_CCIPR2_SDMMC1SEL_V(n)   BF_RCC_CCIPR2_SDMMC1SEL(BV_RCC_CCIPR2_SDMMC1SEL_##n)
/* Shorthand for convenience */
#define SDMMC1SEL_V(n)                  BF_RCC_CCIPR2_SDMMC1SEL_V(n)

/* SAI1 kernel clock selection */
#define BP_RCC_CCIPR2_SAI1SEL       6
#define BM_RCC_CCIPR2_SAI1SEL       (7u << 6)
#define BF_RCC_CCIPR2_SAI1SEL(v)    (((v) & 7u) << 6)
#define BFM_RCC_CCIPR2_SAI1SEL(v)   (7u << 6)
/* 000=PLL1P, 001=PLL2P, 010=PLL3P, 011=AUDCLKIN, 100=MSIK */

/* USB clock selection */
#define BP_RCC_CCIPR2_ICLKSEL       26
#define BM_RCC_CCIPR2_ICLKSEL       (3u << 26)
#define BF_RCC_CCIPR2_ICLKSEL(v)    (((v) & 3u) << 26)
#define BFM_RCC_CCIPR2_ICLKSEL(v)   (3u << 26)
/* 00=HSI48, 01=PLL2Q, 10=PLL1Q, 11=MSIK */
#define BV_RCC_CCIPR2_ICLKSEL_HSI48 0
#define BF_RCC_CCIPR2_ICLKSEL_V(n)  BF_RCC_CCIPR2_ICLKSEL(BV_RCC_CCIPR2_ICLKSEL_##n)
/* Shorthand for convenience */
#define ICLKSEL_V(n)                BF_RCC_CCIPR2_ICLKSEL_V(n)

/* RCC_APB2ENR additions - LTDC clock enable (bit 26) */
#define BP_RCC_APB2ENR_LTDCEN       26
#define BM_RCC_APB2ENR_LTDCEN       (1u << 26)
#define BF_RCC_APB2ENR_LTDCEN(v)    (((v) & 1u) << 26)
#define BFM_RCC_APB2ENR_LTDCEN(v)   (1u << 26)

