alexanderboric/rockbox/firmware/target/arm/stm32u5/regs/stm32u5a5/rcc.h
/* RCC_PLL3CFGR - PLL3 configuration register (+0x030)
 * Used to generate LTDC pixel clock via PLL3R.
 * NOTE: verify offset against RM0456.
 */
#define ITA_RCC_PLL3CFGR    ((uint32_t *)(RCC_BASE + 0x030))
#define ITTA_RCC_PLL3CFGR   uint32_t
#define ITNA_RCC_PLL3CFGR   RCC_PLL3CFGR

#define BP_RCC_PLL3CFGR_PLL3SRC     0
#define BM_RCC_PLL3CFGR_PLL3SRC     (3u << 0)
#define BF_RCC_PLL3CFGR_PLL3SRC(v)  (((v) & 3u) << 0)
#define BFM_RCC_PLL3CFGR_PLL3SRC(v) (3u << 0)
#define BV_RCC_PLL3CFGR_PLL3SRC_HSI16  2
#define BF_RCC_PLL3CFGR_PLL3SRC_V(n)   BF_RCC_PLL3CFGR_PLL3SRC(BV_RCC_PLL3CFGR_PLL3SRC_##n)
/* Shorthand for convenience */
#define PLL3SRC_V(n)                   BF_RCC_PLL3CFGR_PLL3SRC_V(n)

/* PLL3RGE: input freq range (10 = 8-16 MHz) */
#define BP_RCC_PLL3CFGR_PLL3RGE     2
#define BM_RCC_PLL3CFGR_PLL3RGE     (3u << 2)
#define BF_RCC_PLL3CFGR_PLL3RGE(v)  (((v) & 3u) << 2)
#define BFM_RCC_PLL3CFGR_PLL3RGE(v) (3u << 2)

/* PLL3FRACEN: fractional enable */
#define BP_RCC_PLL3CFGR_PLL3FRACEN     4
#define BM_RCC_PLL3CFGR_PLL3FRACEN     (1u << 4)
#define BF_RCC_PLL3CFGR_PLL3FRACEN(v)  (((v) & 1u) << 4)
#define BFM_RCC_PLL3CFGR_PLL3FRACEN(v) (1u << 4)

/* PLL3VCOSEL: 0=wide VCO (128-544), 1=medium VCO (150-420) */
#define BP_RCC_PLL3CFGR_PLL3VCOSEL     5
#define BM_RCC_PLL3CFGR_PLL3VCOSEL     (1u << 5)
#define BF_RCC_PLL3CFGR_PLL3VCOSEL(v)  (((v) & 1u) << 5)
#define BFM_RCC_PLL3CFGR_PLL3VCOSEL(v) (1u << 5)

/* DIVM3: M prescaler (0 = divide by 1) */
#define BP_RCC_PLL3CFGR_DIVM3      8
#define BM_RCC_PLL3CFGR_DIVM3      (0x3Fu << 8)
#define BF_RCC_PLL3CFGR_DIVM3(v)   (((v) & 0x3Fu) << 8)
#define BFM_RCC_PLL3CFGR_DIVM3(v)  (0x3Fu << 8)

/* PLL3REN: enable PLL3R output */
#define BP_RCC_PLL3CFGR_PLL3REN     18
#define BM_RCC_PLL3CFGR_PLL3REN     (1u << 18)
#define BF_RCC_PLL3CFGR_PLL3REN(v)  (((v) & 1u) << 18)
#define BFM_RCC_PLL3CFGR_PLL3REN(v) (1u << 18)

/* RCC_PLL3DIVR - PLL3 dividers register (+0x044)
 * Config for 12 MHz pixel clock: HSI16, M=1, N=9, R=12
 *   DIVN3 = N-1 = 8  → VCO = 16*9 = 144 MHz
 *   DIVR3 = R-1 = 11 → PLL3R = 144/12 = 12 MHz
 * NOTE: verify offset against RM0456.
 */
#define ITA_RCC_PLL3DIVR    ((uint32_t *)(RCC_BASE + 0x044))
#define ITTA_RCC_PLL3DIVR   uint32_t
#define ITNA_RCC_PLL3DIVR   RCC_PLL3DIVR

#define BP_RCC_PLL3DIVR_DIVN3    0
#define BM_RCC_PLL3DIVR_DIVN3    (0x1FFu << 0)
#define BF_RCC_PLL3DIVR_DIVN3(v) (((v) & 0x1FFu) << 0)
#define BFM_RCC_PLL3DIVR_DIVN3(v) (0x1FFu << 0)

#define BP_RCC_PLL3DIVR_DIVR3    24
#define BM_RCC_PLL3DIVR_DIVR3    (0x7Fu << 24)
#define BF_RCC_PLL3DIVR_DIVR3(v) (((v) & 0x7Fu) << 24)
#define BFM_RCC_PLL3DIVR_DIVR3(v) (0x7Fu << 24)

/* RCC_CCIPR3 - Clock configuration register 3 (+0x108)
 * NOTE: verify offset and bit positions against RM0456.
 */
#define ITA_RCC_CCIPR3      ((uint32_t *)(RCC_BASE + 0x108))
#define ITTA_RCC_CCIPR3     uint32_t
#define ITNA_RCC_CCIPR3     RCC_CCIPR3

/* LTDCSEL: LTDC pixel clock source [4:3]
 * 00=PLL2R, 01=PLL3R, 10=HSI48, 11=MSI */
#define BP_RCC_CCIPR3_LTDCSEL       3
#define BM_RCC_CCIPR3_LTDCSEL       (3u << 3)
#define BF_RCC_CCIPR3_LTDCSEL(v)    (((v) & 3u) << 3)
#define BFM_RCC_CCIPR3_LTDCSEL(v)   (3u << 3)
#define BV_RCC_CCIPR3_LTDCSEL_PLL3R 1
#define BF_RCC_CCIPR3_LTDCSEL_V(n)  BF_RCC_CCIPR3_LTDCSEL(BV_RCC_CCIPR3_LTDCSEL_##n)
/* Shorthand for convenience */
#define LTDCSEL_V(n)                BF_RCC_CCIPR3_LTDCSEL_V(n)

#endif /* __REGS_STM32U5A5_RCC_H__ */
